---
title: IndexTriangle
classe: Autodesk.Revit.DB.DirectContext3D.IndexTriangle
namespace: Autodesk.Revit.DB.DirectContext3D
eredita: Autodesk.Revit.DB.DirectContext3D.IndexPrimitive
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# IndexTriangle

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 Index0 { get; set; }` | `indexTriangle.Index0` | Int32 |
| `Int32 Index1 { get; set; }` | `indexTriangle.Index1` | Int32 |
| `Int32 Index2 { get; set; }` | `indexTriangle.Index2` | Int32 |
| `Int32 GetSizeInShortInts()` | `IndexTriangle.GetSizeInShortInts()` | Int32 |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```